"""
Повернемося до нашого першого завдання з четвертого модуля і перепишемо його за допомогою функції reduce.
Нагадаємо умову. У нас є список показань заборгованостей з комунальних послуг наприкінці місяця. 
Заборгованості можуть бути від'ємними — у нас переплата, чи додатними, якщо необхідно сплатити за рахунками.
За допомогою reduce підсумуйте додатні значення та поверніть з функції amount_payment суму платежу в кінці місяця.
"""

from functools import reduce


def amount_payment(payment: list):
    """..."""
    return reduce (lambda x, y: x + y, list(filter(lambda x: x > 0, payment)))


print(amount_payment([1, -3, 4, 15, 0, 5]))